In [1]:
import pandas as pd
titan = pd.read_csv("titanic.csv", index_col='PassengerId')

In [2]:
print(titan.shape)

(891, 11)

In [3]:
print(titan.head())

             Survived  Pclass  \
PassengerId
1                   0       3
2                   1       1
3                   1       3
4                   1       1
5                   0       3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0

             SibSp  Parch            Ticket     Fare Cabin Embarked
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
5                0      0            373450   8.0500   NaN        S

In [4]:
titan = titan[['Pclass','Sex','Age','SibSp','Parch','Fare','Survived']]

In [5]:
print(titan.head())

             Pclass     Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    male  22.0      1      0   7.2500         0
2                 1  female  38.0      1      0  71.2833         1
3                 3  female  26.0      0      0   7.9250         1
4                 1  female  35.0      1      0  53.1000         1
5                 3    male  35.0      0      0   8.0500         0

In [6]:
titan['Sex'] =titan['Sex'].map({'male': 0, 'female': 1})

In [7]:
print(titan.head())

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    0  22.0      1      0   7.2500         0
2                 1    1  38.0      1      0  71.2833         1
3                 3    1  26.0      0      0   7.9250         1
4                 1    1  35.0      1      0  53.1000         1
5                 3    0  35.0      0      0   8.0500         0

In [9]:
titan.head(12)

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    0  22.0      1      0   7.2500         0
2                 1    1  38.0      1      0  71.2833         1
3                 3    1  26.0      0      0   7.9250         1
4                 1    1  35.0      1      0  53.1000         1
5                 3    0  35.0      0      0   8.0500         0
6                 3    0   NaN      0      0   8.4583         0
7                 1    0  54.0      0      0  51.8625         0
8                 3    0   2.0      3      1  21.0750         0
9                 3    1  27.0      0      2  11.1333         1
10                2    1  14.0      1      0  30.0708         1
11                3    1   4.0      1      1  16.7000         1
12                1    1  58.0      0      0  26.5500         1

In [10]:
titan.dropna()

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    0  22.0      1      0   7.2500         0
2                 1    1  38.0      1      0  71.2833         1
3                 3    1  26.0      0      0   7.9250         1
4                 1    1  35.0      1      0  53.1000         1
5                 3    0  35.0      0      0   8.0500         0
...             ...  ...   ...    ...    ...      ...       ...
886               3    1  39.0      0      5  29.1250         0
887               2    0  27.0      0      0  13.0000         0
888               1    1  19.0      0      0  30.0000         1
890               1    0  26.0      0      0  30.0000         1
891               3    0  32.0      0      0   7.7500         0

[714 rows x 7 columns]

In [11]:
titan.head(12)

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    0  22.0      1      0   7.2500         0
2                 1    1  38.0      1      0  71.2833         1
3                 3    1  26.0      0      0   7.9250         1
4                 1    1  35.0      1      0  53.1000         1
5                 3    0  35.0      0      0   8.0500         0
6                 3    0   NaN      0      0   8.4583         0
7                 1    0  54.0      0      0  51.8625         0
8                 3    0   2.0      3      1  21.0750         0
9                 3    1  27.0      0      2  11.1333         1
10                2    1  14.0      1      0  30.0708         1
11                3    1   4.0      1      1  16.7000         1
12                1    1  58.0      0      0  26.5500         1

In [12]:
titan = titan.dropna()

In [13]:
titan.head(12)

             Pclass  Sex   Age  SibSp  Parch     Fare  Survived
PassengerId
1                 3    0  22.0      1      0   7.2500         0
2                 1    1  38.0      1      0  71.2833         1
3                 3    1  26.0      0      0   7.9250         1
4                 1    1  35.0      1      0  53.1000         1
5                 3    0  35.0      0      0   8.0500         0
7                 1    0  54.0      0      0  51.8625         0
8                 3    0   2.0      3      1  21.0750         0
9                 3    1  27.0      0      2  11.1333         1
10                2    1  14.0      1      0  30.0708         1
11                3    1   4.0      1      1  16.7000         1
12                1    1  58.0      0      0  26.5500         1
13                3    0  20.0      0      0   8.0500         0

In [14]:
x = titan.drop('Survived', axis=1)
y = titan['Survived']

In [16]:
y

PassengerId
1      0
2      1
3      1
4      1
5      0
      ..
886    0
887    0
888    1
890    1
891    0
Name: Survived, Length: 714, dtype: int64

In [17]:
x

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
1                 3    0  22.0      1      0   7.2500
2                 1    1  38.0      1      0  71.2833
3                 3    1  26.0      0      0   7.9250
4                 1    1  35.0      1      0  53.1000
5                 3    0  35.0      0      0   8.0500
...             ...  ...   ...    ...    ...      ...
886               3    1  39.0      0      5  29.1250
887               2    0  27.0      0      0  13.0000
888               1    1  19.0      0      0  30.0000
890               1    0  26.0      0      0  30.0000
891               3    0  32.0      0      0   7.7500

[714 rows x 6 columns]

In [19]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, random_state=1)

In [21]:
x_test

             Pclass  Sex   Age  SibSp  Parch      Fare
PassengerId
690               1    1  15.0      0      1  211.3375
279               3    0   7.0      4      1   29.1250
507               2    1  33.0      0      2   26.0000
10                2    1  14.0      1      0   30.0708
495               3    0  21.0      0      0    8.0500
...             ...  ...   ...    ...    ...       ...
323               2    1  30.0      0      0   12.3500
598               3    0  49.0      0      0    0.0000
437               3    1  21.0      2      2   34.3750
258               1    1  30.0      0      0   86.5000
453               1    0  30.0      0      0   27.7500

[179 rows x 6 columns]

In [22]:
x_train

             Pclass  Sex   Age  SibSp  Parch     Fare
PassengerId
814               3    1   6.0      4      2  31.2750
449               3    1   5.0      2      1  19.2583
146               2    0  19.0      1      1  36.7500
881               2    1  25.0      0      1  26.0000
311               1    1  24.0      0      0  83.1583
...             ...  ...   ...    ...    ...      ...
180               3    0  36.0      0      0   0.0000
809               2    0  39.0      0      0  13.0000
94                3    0  26.0      1      2  20.5750
292               1    1  19.0      1      0  91.0792
52                3    0  21.0      0      0   7.8000

[535 rows x 6 columns]

In [23]:
y_test

PassengerId
690    1
279    0
507    1
10     1
495    0
      ..
323    1
598    0
437    0
258    1
453    0
Name: Survived, Length: 179, dtype: int64

In [24]:
y_train

PassengerId
814    0
449    1
146    0
881    1
311    1
      ..
180    0
809    0
94     0
292    1
52     0
Name: Survived, Length: 535, dtype: int64